/************************************************************
 * ファイルの説明
 ************************************************************/
// ----------------------------------------------------------
// 関連機能1 - 複数の機能がある場合は機能毎に 定数 - 変数 - イベント
// ----------------------------------------------------------
/* 関連機能1 - さらに階層を作る場合
-------------------------------------------- */
/** 変数・定数はJsDocコメント */
const cccc = '';
/** 変数・定数はJsDocコメント */
let llll = '';

/* 関連機能1 - さらに階層を作る場合
-------------------------------------------- */
/**
 * メソッドも必ずJsDocコメント
 * @param {String} text メッセージ
 * @returns メッセージ
 */
const mmmm = (text) => {
  // 処理は適宜説明コメント　簡潔に
  console.log(text);
  return text;
}

// ----------------------------------------------------------
// 関連機能2 - 複数の機能がある場合は機能毎に 定数 - 変数 - イベント
// ----------------------------------------------------------
/* 関連機能2 - さらに階層を作る場合
-------------------------------------------- */
/** 変数・定数はJsDocコメント */
const cccc2 = '';
/** 変数・定数はJsDocコメント */
let llll2 = '';

/* 関連機能2 - さらに階層を作る場合
-------------------------------------------- */
/**
 * メソッドも必ずJsDocコメント
 * @param {String} text メッセージ
 * @returns メッセージ
 */
const mmmm2 = (text) => {
  // 処理は適宜説明コメント　簡潔に
  console.log(text);
  return text;
}

// ----------------------------------------------------------
// ライフサイクル
// ----------------------------------------------------------
// ライフサイクルは最後に記載
